### 1. DataFrame

In [4]:
import numpy as np
import pandas as pd

- 생성방법 1: 2차원 데이터, 컬럼, 인덱스

In [5]:
df1 = pd.DataFrame(
    np.random.randint(40,101,12).reshape(4,3),           # 2차원 데이터 (반드시 존재해야 함)
    columns=list('XYZ'),                                # 컬럼명
    index=list('abcd')                                  # 인덱스명인데 안줘도 ㄱㅊ
)
df1

    X   Y   Z
a  58  63  48
b  61  67  83
c  48  96  81
d  50  61  48

- 생성 방법: 딕셔너리의 리스트

In [6]:
data = [
    {'X':41,'Y':76,'Z':100},
    {'X':84,'Y':87,'Z':43},
    {'X':50,'Y':79,'Z':71},
    {'X':62,'Y':43,'Z':47}
]
df2 = pd.DataFrame(data,index=list('abcd'))
df2

    X   Y    Z
a  41  76  100
b  84  87   43
c  50  79   71
d  62  43   47

- 생성 방법 3: 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [7]:
data = {
    'X':[41,84,50,62],
    'Y':[76,87,79,43],
    'Z':[100,43,71,47]
}
df3 = pd.DataFrame(data,index=list('abcd'))
df3

    X   Y    Z
a  41  76  100
b  84  87   43
c  50  79   71
d  62  43   47

In [8]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [9]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [10]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [11]:
# 생성한 후에 인데스 이름과 컬럼 이름 줘도 ㄱㅊ
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [12]:
col_A, col_B, col_C, col_D, col_E = [],[],[],[],[]
np.random.seed = 2023
for i in range(5):
    col_A.append(chr(np.random.randint(65,91)) + chr(np.random.randint(65,91)))
    col_B.append(np.random.randint(1,7))
    col_C.append(np.random.randint(40,101))
    col_D.append(np.random.randint(1,100)*1000)
    col_E.append(np.round(np.random.rand(),4))
df4 = pd.DataFrame({
    'col_A':col_A,'col_b':col_B,'col_C':col_C,'col_D':col_D,'col_E':col_E
})
df4

  col_A  col_b  col_C  col_D   col_E
0    LM      4     82  80000  0.6127
1    DC      4     72  60000  0.0018
2    SO      2     50  81000  0.7685
3    VV      3     84   2000  0.4977
4    LK      4     70   8000  0.1762

In [13]:
n_d = {}
nn_list = []

for i in range(5):
    nn_dd ={
        'col_A':chr(np.random.randint(65,91)) + chr(np.random.randint(65,91)),
        'col_B':np.random.randint(1,7),
        'col_C':np.random.randint(40,101),
        'col_D':np.random.randint(1,100)*1000,
        'col_E':np.round(np.random.rand(),4)
    }
    nn_list.append(nn_dd)
df5 = pd.DataFrame(nn_list)
df5

  col_A  col_B  col_C  col_D   col_E
0    FG      2     66   7000  0.7381
1    QS      3     64  71000  0.4244
2    OH      5     81   3000  0.8456
3    VC      2     73  52000  0.8804
4    GH      5     81   3000  0.3130

- 전치(Transpose)

In [14]:
df1.T

    a   b   c   d
X  58  61  48  50
Y  63  67  96  61
Z  48  83  81  48

In [15]:
df5.T

            0       1       2       3      4
col_A      FG      QS      OH      VC     GH
col_B       2       3       5       2      5
col_C      66      64      81      73     81
col_D    7000   71000    3000   52000   3000
col_E  0.7381  0.4244  0.8456  0.8804  0.313

- 열 데이터의 갱신, 추가, 삭제

In [16]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [17]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [18]:
# 열 이름이 있으면 갱신, 없으면 생성
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [19]:
# 열 삭제
del df['2010-2015 증가율']
df

항목   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

- 열 인덱싱

In [20]:
df['지역']              # 열 이름을 하나만 선택하면 시리즈 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [21]:
df[['2015','2010']]             # 열 이름을 여러개 리스트로 주면, 데이터프레임 반환

항목     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [22]:
df[['2015']]                # 하나 줘도 리스트로 주면 데이터프레임으로 반환

항목     2015
도시
서울  9904312
부산  3448737
인천  2890451
대구  2466052

- 개별 인덱싱

In [23]:
# 열 이름, 행 인덱스
df['지역']['서울'], df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권')

In [24]:
# 컬럼명이 숫자라 안됨, 중간에 공백있어도 안됨
# df.2015.서울
df['2015']['서울']

9904312

In [25]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [26]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [27]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [30]:
df['평균'] = ((df['국어']+df['수학']+df['영어'])/3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [50]:
import warnings
warnings.filterwarnings('ignore')
df.영어.방자 = 80
df['평균'] = ((df['국어']+df['수학']+df['영어'])/3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [52]:
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [53]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [48]:
# 행 인덱싱 하고 싶으면 전치해서 하기
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64